{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "llama",
  "hidden_size": 2048,
  "intermediate_size": 5632,
  "num_attention_heads": 32,
  "num_hidden_layers": 22,
  "use_cache": false,
  "rms_norm_eps": 1e-05,
  "num_key_value_heads": 4
}
