{
    "architectures": [
      "LlamaForCausalLM"
    ],
    "model_type": "llama",
    "hidden_size": 1024,
    "intermediate_size": 2688,
    "num_attention_heads": 16,
    "num_hidden_layers": 12,
    "use_cache": false,
    "rms_norm_eps": 1e-05
}

